Revit 2027 API
ExternalServices.BuiltInExternalServices.CustomFieldEditPropertiesService Property
 Autodesk Internal: The service for editing properties of a custom field.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId CustomFieldEditPropertiesService { get; }
Public Shared ReadOnly Property CustomFieldEditPropertiesService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ CustomFieldEditPropertiesService {
	ExternalServiceId^ get ();
}
static member CustomFieldEditPropertiesService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace